tests/xma40provisioning/updateUserGroupsByName.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://provisioning.intf.mobilgw.com/">
  <soap:Body>
    <tns:updateUserGroupsByName>
      <arg0>HelloGrp</arg0>
      <arg1>
        <attributes>
          <name>scg_description</name>
          <value>hello Grp</value>
        </attributes>
        <userGroupName>HelloGrp</userGroupName>
      </arg1>
      <arg2>HelloGrp</arg2>
    </tns:updateUserGroupsByName>
  </soap:Body>
</soap:Envelope>